#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
data.aws_route53_zone.selected: Reading...
aws_s3_bucket_policy.public_read_get_object: Refreshing state... [id=aheadinthecloud.com]
aws_s3_bucket.subdomain: Refreshing state... [id=www.aheadinthecloud.com]
aws_s3_bucket_website_configuration.subdomain: Refreshing state... [id=www.aheadinthecloud.com]
data.aws_caller_identity.current: Read complete after 0s [id=004351562122]
aws_s3_bucket.domain: Refreshing state... [id=aheadinthecloud.com]
aws_s3_bucket.logs: Refreshing state... [id=logs.aheadinthecloud.com]
aws_s3_bucket_website_configuration.domain: Refreshing state... [id=aheadinthecloud.com]
aws_s3_bucket_public_access_block.domain: Refreshing state... [id=aheadinthecloud.com]
aws_s3_bucket_logging.domain: Refreshing state... [id=aheadinthecloud.com]
data.aws_route53_zone.selected: Read complete after 1s [id=Z08846413OJRCH3MJOFHV]
aws_route53_record.domain: Refreshing state... [id=Z08846413OJRCH3MJOFHV_aheadinthecloud.com_A]
aws_route53_record.subdomain: Refreshing state... [id=Z08846413OJRCH3MJOFHV_www.aheadinthecloud.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "aheadinthecloud.com"
      + domain_validation_options = [
          + {
              + domain_name           = "aheadinthecloud.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "aheadinthecloud.com",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_route53_record.acm["aheadinthecloud.com"] will be created
  + resource "aws_route53_record" "acm" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z08846413OJRCH3MJOFHV"
    }

  # aws_route53_record.domain will be updated in-place
  ~ resource "aws_route53_record" "domain" {
        id                               = "Z08846413OJRCH3MJOFHV_aheadinthecloud.com_A"
        name                             = "aheadinthecloud.com"
        # (6 unchanged attributes hidden)

      ~ alias {
          ~ name                   = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
          ~ zone_id                = "Z3AQBSTGFYJSTF" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_route53_record.subdomain will be updated in-place
  ~ resource "aws_route53_record" "subdomain" {
        id                               = "Z08846413OJRCH3MJOFHV_www.aheadinthecloud.com_A"
        name                             = "www.aheadinthecloud.com"
        # (6 unchanged attributes hidden)

      ~ alias {
          ~ name                   = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
          ~ zone_id                = "Z3AQBSTGFYJSTF" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_s3_bucket.domain must be replaced
-/+ resource "aws_s3_bucket" "domain" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::aheadinthecloud.com" -> (known after apply)
      ~ bucket                      = "aheadinthecloud.com" -> "aheadinthecloud-us-east-1-004351562122-prod" # forces replacement
      ~ bucket_domain_name          = "aheadinthecloud.com.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "aheadinthecloud.com.s3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "aheadinthecloud.com" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::aheadinthecloud.com/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      ~ website_domain              = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint            = "aheadinthecloud.com.s3-website-us-east-1.amazonaws.com" -> (known after apply)
        # (1 unchanged attribute hidden)

      - grant {
          - id          = "236eaafd9286a41f6d33fa8f096290921d529a32d07c40c63ba26df2ec2779cc" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - logging {
          - target_bucket = "logs.aheadinthecloud.com" -> null
          - target_prefix = "logs/" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "404/index.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # aws_s3_bucket.logs must be replaced
-/+ resource "aws_s3_bucket" "logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::logs.aheadinthecloud.com" -> (known after apply)
      ~ bucket                      = "logs.aheadinthecloud.com" -> "aheadinthecloud-log-logs-us-east-1-004351562122-prod" # forces replacement
      ~ bucket_domain_name          = "logs.aheadinthecloud.com.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "logs.aheadinthecloud.com.s3.amazonaws.com" -> (known after apply)
      ~ force_destroy               = false -> true
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "logs.aheadinthecloud.com" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      - grant {
          - id          = "236eaafd9286a41f6d33fa8f096290921d529a32d07c40c63ba26df2ec2779cc" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.subdomain will be destroyed
  # (because aws_s3_bucket.subdomain is not in configuration)
  - resource "aws_s3_bucket" "subdomain" {
      - arn                         = "arn:aws:s3:::www.aheadinthecloud.com" -> null
      - bucket                      = "www.aheadinthecloud.com" -> null
      - bucket_domain_name          = "www.aheadinthecloud.com.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "www.aheadinthecloud.com.s3.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "www.aheadinthecloud.com" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - website_domain              = "s3-website-us-east-1.amazonaws.com" -> null
      - website_endpoint            = "www.aheadinthecloud.com.s3-website-us-east-1.amazonaws.com" -> null

      - grant {
          - id          = "236eaafd9286a41f6d33fa8f096290921d529a32d07c40c63ba26df2ec2779cc" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - redirect_all_requests_to = "http://aheadinthecloud.com" -> null
        }
    }

  # aws_s3_bucket_logging.domain must be replaced
-/+ resource "aws_s3_bucket_logging" "domain" {
      ~ bucket        = "aheadinthecloud.com" # forces replacement -> (known after apply) # forces replacement
      ~ id            = "aheadinthecloud.com" -> (known after apply)
      ~ target_bucket = "logs.aheadinthecloud.com" -> (known after apply)
      ~ target_prefix = "logs/" -> "s3"
    }

  # aws_s3_bucket_policy.public_read_get_object will be destroyed
  # (because aws_s3_bucket_policy.public_read_get_object is not in configuration)
  - resource "aws_s3_bucket_policy" "public_read_get_object" {
      - bucket = "aheadinthecloud.com" -> null
      - id     = "aheadinthecloud.com" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::aheadinthecloud.com/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # aws_s3_bucket_public_access_block.domain must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "domain" {
      ~ block_public_acls       = false -> true
      ~ block_public_policy     = false -> true
      ~ bucket                  = "aheadinthecloud.com" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "aheadinthecloud.com" -> (known after apply)
      ~ ignore_public_acls      = false -> true
      ~ restrict_public_buckets = false -> true
    }

  # aws_s3_bucket_website_configuration.domain must be replaced
-/+ resource "aws_s3_bucket_website_configuration" "domain" {
      ~ bucket           = "aheadinthecloud.com" # forces replacement -> (known after apply) # forces replacement
      ~ id               = "aheadinthecloud.com" -> (known after apply)
      + routing_rules    = (known after apply)
      ~ website_domain   = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint = "aheadinthecloud.com.s3-website-us-east-1.amazonaws.com" -> (known after apply)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket_website_configuration.subdomain will be destroyed
  # (because aws_s3_bucket_website_configuration.subdomain is not in configuration)
  - resource "aws_s3_bucket_website_configuration" "subdomain" {
      - bucket           = "www.aheadinthecloud.com" -> null
      - id               = "www.aheadinthecloud.com" -> null
      - website_domain   = "s3-website-us-east-1.amazonaws.com" -> null
      - website_endpoint = "www.aheadinthecloud.com.s3-website-us-east-1.amazonaws.com" -> null

      - redirect_all_requests_to {
          - host_name = "aheadinthecloud.com" -> null
          - protocol  = "http" -> null
        }
    }

  # module.cloudfront.aws_cloudfront_distribution.this[0] will be created
  + resource "aws_cloudfront_distribution" "this" {
      + aliases                        = [
          + "www.aheadinthecloud.com",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "aheadinthecloud.com distribution"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2and3"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = false

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "s3"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = []

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + logging_config {
          + bucket          = (known after apply)
          + include_cookies = false
          + prefix          = "cloudfront"
        }

      + ordered_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + path_pattern           = "*"
          + target_origin_id       = "s3"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = []

              + cookies {
                  + forward = "none"
                }
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "s3"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.cloudfront.aws_cloudfront_monitoring_subscription.this[0] will be created
  + resource "aws_cloudfront_monitoring_subscription" "this" {
      + distribution_id = (known after apply)
      + id              = (known after apply)

      + monitoring_subscription {
          + realtime_metrics_subscription_config {
              + realtime_metrics_subscription_status = "Enabled"
            }
        }
    }

  # module.cloudfront.aws_cloudfront_origin_access_control.this["s3_oac"] will be created
  + resource "aws_cloudfront_origin_access_control" "this" {
      + description                       = "cloudfront access to s3"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "s3_oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

Plan: 11 to add, 2 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mmccarthy404, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-ci`*